[
    {
        "title": "Focaccia with Tomato, Green Onion and Garlic",
        "image": "https://img.spoonacular.com/recipes/643175-556x370.jpg",
        "readyInMinutes": 45,
        "categories": [
            "vegetarian",
            "vegan",
            "glutenFree",
            "dairyFree"
        ],
        "instructions": "<ol><li>Note: You can use a standing mixer with a dough hook to mix the dough, but we made our bread the old-fashioned way, kneading it with our hands.</li><li>Combine the yeast with warm water (this is referred to as proofing the yeast) in a small bowl along with the sugar. Gently stir the mixture to dissolve everything. Allow the yeast to stand for about 3 minutes until it gets a bit foamy.</li><li>Add the flour to a large bowl and make a well in the center of it.</li><li>In a small bowl, dissolve the salt in a few tablespoons of water, and add it to the flour along with the yeast mixture. Next add the olive oil to the mixture.</li><li>With your hands and a spatula to scrape down the bowl, mix everything together to form the dough. Punch down and knead the dough, turning it as you go, for at least 10 minutes or until the dough is smooth, soft and pliable. Add a bit of flour to the dough as needed. Form the dough into a round ball.</li><li>Add some olive oil to your hands and smooth it over the dough ball to coat it and leave it in the bowl. Cover the bowl with a thick towel and place the bowl in a warm spot to let the dough rise to double its size (about 45 minutes to an hour).</li><li>Coat a baking sheet (with sides) with olive oil and sprinkle a few tablespoons of cornmeal over the entire pan. Set aside.</li><li>Once the dough has risen, place it on a floured surface and punch it down 3-4 times. Allow it to stand for a few minutes while you get your toppings ready.</li><li>Moving back to the dough, roll and stretch it out into an oblong shape that is about 1/2 an inch thick. Place the dough on the oiled baking sheet, cover it with plastic wrap and let it stand for about 15 minutes.</li><li>Preheat your oven to 400 degrees F. After the dough has rested and youre ready to bake it, poke small wells all around the dough using your finger. Brush the surface of the dough with olive oil.</li><li>Evenly sprinkle on the dried oregano, green onion, tomato and garlic. Sprinkle with coarse salt, then grated Parmesan cheese.</li><li>Bake on the bottom rack for 20 minutes, checking it as it gets close to the end of the baking time.</li></ol>",
        "ingredients": [
            "1 tablespoon coarse salt",
            "4 cups flour (if you want thinner focaccia, use about 3 cups of flour)",
            "1 garlic clove, sliced thin",
            "1 green onion, minced",
            "4 tablespoons Olive Oil",
            "1/2-1 teaspoons dried oregano",
            "2 tablespoons grated parmesan cheese",
            "1 tablespoon sugar",
            "1-1/2 small tomatoes, diced",
            "1/2 pint Warm Water",
            "2 teaspoons of quick-rising yeast"
        ]
    },
    {
        "title": "Tropical Pineapple Cupcakes",
        "image": "https://img.spoonacular.com/recipes/663861-556x370.jpg",
        "readyInMinutes": 45,
        "categories": [
            "vegetarian"
        ],
        "instructions": "<ol><li>For the Cupcakes:</li><li>Preheat oven to 350 degrees.</li><li>Line cupcake tin with 18 cupcake liners and set aside.</li><li>In a medium bowl combine the flour, baking powder and salt.</li><li>Beat together the butter and sugar until fluffy.</li><li>Add the vanilla and eggs one at a time until well combined.</li><li>Add the flour mixture alternating with the milk.</li><li>Mix until just combined.</li><li>Add 1 teaspoon of batter to the bottom of each cupcake liner.  Add a cherry.</li><li>Top with 1 tablespoon of batter.</li><li>NOTE:  This batter is thick.  In order to spread the batter easily dip finger tips in water.  Then spread.</li><li>Add 4 pieces of pineapple.  (that will be originally 2 chunks cut in half)</li><li>Top with another tablespoon of batter.</li><li>NOTE:  You'll need to use the same spreading method you did for the first layer.</li><li>Bake 20 - 23 minutes.</li><li>Cool on wire rack in cupcake pans.</li><li>Frost with pineapple cream cheese frosting when completely cooled.</li><li>Top with a pineapple wedge (optional).</li><li>For the Pineapple Cream Cheese Frosting:</li><li>Cream together the cream cheese and butter until fluffy.  Add the vanilla and pineapple and mix until well combined.  Add the confectioners sugar 1 cup at a time.  Store frosted goods in the refrigerator.</li></ol>",
        "ingredients": [
            "1-1/2 cups all purpose flour",
            "1-1/2 teaspoons baking powder",
            "2 tablespoons Melted Butter",
            "2 pounds confectioners' sugar",
            "8 ounce cream cheese, softened",
            "4 Eggs, plus 1 Egg Yolk",
            "1 cup granulated sugar",
            "18 maraschino cherries",
            "1 quart #milk",
            "1/2 cup crushed pineapple with juice",
            "20 ounce can pineapple chunks (each chunk cut in half)",
            "pineapple rings (garnish, cut into wedges)",
            "1/4 teaspoon salt",
            "1/2 teaspoon vanilla",
            "1 teaspoon Pure Vanilla Extract"
        ]
    },
    {
        "title": "Pesto Zucchini \"Spaghetti",
        "image": "https://img.spoonacular.com/recipes/655853-556x370.jpg",
        "readyInMinutes": 45,
        "categories": [
            "glutenFree"
        ],
        "instructions": "Place zucchini strips in a colander over a bowl or in the sink. Sprinkle zucchini with salt and toss to combine. Let the zucchini sit for 15 minutes while the salt extracts the moisture. Drain excess water, squeezing zucchini, if necessary.\nMeanwhile, cook bacon in a skillet over medium heat until crisp, turning frequently. Remove bacon to a stack of paper towels to drain. Crumble bacon. Remove all but 2 T of bacon drippings from the pan.\nReturn the pan to medium heat. Add the green onions and broccoli, stirring frequently for about 3-5 minutes or until crisp-tender. Add zucchini and 2 T of pesto, tossing to combine all ingredients. Taste and add more pesto, if needed. The mixture only needs to warm up, so 2-3 minutes of cooking ought to do it.\nServe with bacon crumbles and freshly grated Parmesan cheese.",
        "ingredients": [
            "4 medium zucchini, julienned thinly (mandoline slicers are great for this)",
            "generous pinch of salt",
            "6 slices of uncooked bacon",
            "1/2 cup green onions, sliced into 1-inch pieces",
            "2 cups broccoli florets",
            "2-3 T prepared basil pesto",
            "Fresh Parmesan or Romano cheese, for garnish"
        ]
    }
]

